import random
import ast
import streamlit as st
import streamlit.components.v1 as components
import altair as alt
import pandas as pd
import numpy as np
pd.set_option('display.max_colwidth', 50)
@st.cache  # Add caching so we load the data only once
def load_data(path):
    data = pd.read_csv(path)
    data.drop(columns=['Unnamed: 0'], inplace=True)
    return data

def pastel_styling(df):
    return df.style.applymap(lambda x: "background-color: %s" % "paleturquoise")

# data = load_data()

def show_plot(dictionary=None, key=None, plotname=None, height=800):
    if key:
        plotname = dictionary[key]
        HtmlFile = open(plotname, 'r', encoding='utf-8')
        source_code = HtmlFile.read()
        print(source_code)
        components.html(source_code, height=height)

st.set_page_config(layout="wide")


st.title('Аналіз медіа наративів навколо обстрілу Краматорського вокзалу')

st.warning('Задача: Провести аналіз поширення їх новин у ЗМІ з цього приводу після 10 год. 28 хв. 08 квітня 2022 року із встановленням першоджерела, подальшого поширення, яким чином подавалась інформація щодо того ким здійснено обстріл та щодо засобів, які використовувались, а також яким чином змінювалась інформація, яка подавалася.')
########################Загальні деталі поширення
st.markdown('### Які новинні наративи поширювались загалом?')

st.markdown('''
Для аналізу новинного поширення навколо події ми спираємось на такі компоненти: 
\n- наративи щодо доказів провини, 
\n- наративи щодо мети (і навмисності), 
\n- наративи щодо зброї та винуватця (подаються разом з джерелом твердження), 
\n- фреймінг події.
\n
Аналізований період: 14 днів з моменту події. Цей часовий проміжок було обрано як значущий, спираючись на динаміку обговорення теми в російських телеграм каналах.
Дані включають найвпливовіші російські телеграм канали (включно з проросійськими - у випадку представників так званих "ДНР" і "ЛНР"). 
Кожен з поданих графіків - інтерактивний. Для зміни масштаба скористайтесь типовим жестом "збільшити", при наведенні на відповідну частину графіка ви побачите підказку.
Зауважте, будь ласка, що обираючи вищий рівень узагальнення, ви будете бачити наративи згруповано, і твердження в тексті не будуть напряму відтворювати назву групи наративів, а будуть стосуватись назви групи узагальнено. Наприклад, твердження “Сначала они опубликовали ролик, демонстрирующий последствия обстрела ракетой «Точка У» заполненного людьми вокзала в Краматорске и обвиняющий в этом украинские власти на основании совпадения хорошо видного серийного номера ракеты” буде віднесено на деталізованому рівні до групи “Серийные номера как у используемых ЗСУ на Донбассе”, але на наступному рівні узагальнення - до групи “Точка У - только украинское оружие”, в яку також увійдуть наративи “Отсутствие Точек-У на вооружении России”, “Активное использование аналогичных "Точка-У" Украиной” та інші.
Такі узагальнення є корисним спрощенням, яке прибирає нюанси для розуміння глобальної картини; щоб бачити найбільш точні наративи, обирайте найнижчий рівень узагальнення.

''')

options_general_narratives = ['Докази', 'Винуватець', 'Мета', "Фреймінг"]
selected_option1 = st.radio('Оберіть, будь ласка, тип наратива:', options_general_narratives, key='general_narrative')
st.write(f'Ви переглядаєте динаміку наратива: {selected_option1}')
section1_mapping={'Винуватець':'data_v2/section1_plots/culprit_plot_area_general.html',
                  'Докази': 'data_v2/section1_plots/evidence_plot_area_general.html',
                  'Мета': 'data_v2/section1_plots/goal_plot_area_general.html',
                  'Фреймінг': 'data_v2/section1_plots/framing_plot_area_general.html'}
show_plot(section1_mapping, selected_option1)

#############Докази
st.markdown('### Найважливіші наративи доказів щодо обстрілу')

st.markdown('''
В першу добу після обстрілу російські Телеграм канали здебільшого мотивували провину України траєкторією польота ракети (в тому числі положенням - наприклад, “положение разгонной части и хвоста”); одночасно з цим згадки про “українську” Точку У в постах позначали походження ракети як таке, що не потребує доведення. 
Разом із твердженнями про Точку У згадуються одночасно або поокремо твердження про те, що (1) Україна активно використовувала Точку У для обстрілів Донбаса (2) Росія не має на озброєнні Точок У (від прямих заяв до непрямих як-от “Росия использует высокоточное оружие, а не такое старье”).
\n 
На початку - меншою мірою, надалі - частіше найбільш важливими доказами були технічні особливості ракети (наприклад, “сетчатое оперение”), і з появою відповідних матеріалів - серійні номери ракети. Мотив серійних номерів надалі трансформується в мотивацію провини України тим, що початково ці номери приховувались, що для авторів постів є свідченням наміру, а не випадковістю. Відео від BBC, яке за заявами авторів Телеграм каналів, підтверджує провину України набирає популярності на 6 день після події і є важливим протягом 1-2 днів. 
\n
Протягом всього періода в якості доказа, що це не вигідно Росії, але вигідно Україні (“Бенефициар - Украина”) наводяться можливі переваги для України від цієї події: змусити Росію відмовитись від обстрілів логістичних вузлів для безпечнішого перекидання техніки, створити фон для перемовин, отримати більше підтримки від Заходу і так далі (детальніше розглянемо їх нижче).
Окремим доказом автори називали стишення дискусії щодо обстрілу в українських та російських медіа після публікації серійних номерів. Протягом перших 14 днів активно обговорюється також розташування і попередні обстріли, здійснені 19 ракетною бригадою ЗСУ, саме цей підрозділ визначається як відповідальний.
Надалі наративи навколо доказів повторюються, і риторика транформується в затвердження ідеї що подібні “теракти і постановки” - це типова поведінка України.
\n
Серед аналізованих нами найпопулярніших релевантних Телеграм каналів тільки 2 повідомлення містили припущення, що ракета могла бути випущена Росією для знищення ВСУ: **“❗️Прилеты по ж/д Краматорска в эти минуты. Скорее всего работают по скоплению ВСУ в районе завода (КЦШК) и (СКМЗ).”**  від канала https://t.me/ags_donbass та **“⚡️ Десять минут назад прилёты по ж/д вокзалу Краматорска. Работают по скоплению боевиков ВСУ.”** від канала https://t.me/army_russia. 
Зауважимо, що аналізовані дані не містять видалених повідомлень, відповідно автори, чия позиція виявилась неузгодженою з російською версією подій, мали достатньо часу для видалення таких повідомлень. 
На підтвердження гіпотези щодо видалення повідомлень з початковими заявами про удар Росією, пост від канала https://t.me/zola_of_renovation зазначає, що українські канали інтерпретували репост повідомлення канала https://t.me/rybar каналом https://t.me/boris_rozhin “неправильно”, і задля того, щоб ці повідомлення не ширились як підтверження провини Росії, репост було видалено.  
\n
**“В ответ на мой стандартный текст "почему хохлы совершают военные преступления" о Краматорске украинцы выдали "развеивание фейка". Привожу текст: "Пропагандист Владислав Угольный написал, будто так Украина хотела "сорвать эвакуацию" (которую сама проводит) и "прикрыться мирными жителями". Сообщения на его канале появилось в 11:50. Интересно, что он ссылается на сообщение в российском Телеграмм-канале Сolonelcassad (канал пропагандиста Бориса Рожина, более 500 тыс. аудитории) с превью которого мы видим текст “Официальные власти заявляют об ударе двумя «Искандерами» по вокзалу” и фото с места событий, однако сам пост на канале уже удален". Итак, ссылаюсь я не на г-на Рожина, а на его репост Рыбаря. Потому что Рыбарь у меня не открывается т.к. он заблокирован для тг-аккаунтов, зарегистрированных на симкарту с кодом +380, включая Феникс. У Рожина просто отображаются репосты с Рыбаря, вот и всё, не он его автор, украинские "фактчекеры". Данный пост Рыбарем не удалён. Борис Рожин репост действительно удалил. Почему? Сделаю предположение: чтобы украинские леминги из интернет армии не заспамили жалобами пост с фотками русских, погибших во время украинского обстрела Краматорска."**
\n
В перший день після події найбільш згадуваними джерелами є МО РФ, Зеленський, Басурін та Арестович. Надалі Телеграм канали спираються на свідчення про-російських джерел (включно з так званими “днр і лнр”) та “свідчень місцевих жителів в місцевих телеграм каналах” (на графіку позначені як неідентифіковані люди). На початку саркастично згадуються перші заяви українських джерел про “Іскандери”, надалі свідчення українських джерел використовуються напряму після офіційних заяв про те, що удар було здійснено Точкою У.
Заяви Арестовича (як до так і після події) є важливим джерелом, яке інтерпретується на користь Росії довільним чином: “Как перед первой Бучей Арестович обещал «сюрприз»” (https://t.me/sashakots), “А вот и Арестович высказался по удару по ж/д вокзалу Краматорска. Что и требовалось доказать – Киев создаёт вторую Бучу. ” (https://t.me/rlz_the_kraken), “Арестович и Гауляйтер Донбасса лгут об ударе «Искандерами»”(https://t.me/mig41), “Арестович поспешил заявить про удар Искандером. Хотя "Точка У" однозначно идентифицируется по хвостовой и центральной части (у Искандера нет оперения посередине). Заметят ли это неполживые мировые СМИ? Риторический вопрос.” (https://t.me/sergeykolyasnikov) та інші. 
Важливість риторики навколо заяв Арестовича підтверджується також значною кількістю дублікатів (репостів і перефразувань) цих тверджень на інших каналах. Зокрема, твердження “Как перед первой Бучей Арестович обещал «сюрприз»” зʼявилось зі згадкою оригінального автора на 8 каналах: https://t.me/astramilitarum, https://t.me/gramotyyaroslava, https://t.me/russkiegramoty, https://t.me/ags_donbass, https://t.me/ghost_of_novorossia, https://t.me/epoddubny, https://t.me/medvedevvesti, https://t.me/anna_news.
''')

options_general_levels = ['Найголовніші деталізовано', 'Найголовніші узагальнено', 'Всі']
selected_option4 = st.radio('Оберіть, будь ласка, рівень деталізації:', options_general_levels, key='levels4')
st.write(f'Ви переглядаєте рівень деталізації наратива: {selected_option4}')
section4_mapping={
    'Найголовніші узагальнено': 'data_v2/histo_topN_narratives/level2/plot_HISTO_evidence50_level2.html',
    'Найголовніші деталізовано': 'data_v2/histo_topN_narratives/level1/plot_HISTO_evidence25_level1.html',
    "Всі": 'data_v2/histo_topN_narratives/all/all_evidence_distribution_by_date_top_percent.html'}
show_plot(section4_mapping, selected_option4)

#############Мета
st.markdown('### Найважливіші наративи щодо мети обстрілу')
st.markdown('''
Ідея того, що обстріл міг бути помилкою, не була популярною і поодиноко зустрічалась здебільшого на початку аналізованого періода; автори стверджували обстріл як свідому дію України, яка мала певну мету.
\n
Позиція, що ЗСУ використовували населення для досягнення воєнних цілей, була особливо популярною на початку, в перший день після обстріла. Широко згадувались заклики до евакуації з боку українських посадовців, які передували події, на підтвердження того, що (1) населення збирали на вокзалі для того, щоб прикрити перекидання військової техніки (2) людей намагались залякати щоб зірвати евакуацію і надалі ними прикриватись, або й мобілізувати до лав ЗСУ (3) Україна свідомо знищує нелояльне населення (також траплялись демонізуючі твердження про те, що Україна просто прагне до максимізації жертв серед населення, не обовʼязково не лояльного).
\n Ці твердження часто наводились разом з іншими декларованими цілями України, найбільші з яких це (1) провокація для створення вигідної картинки для Заходу (тобто, залучення додаткової підтримки урядів для України, прямого залучення НАТО, уваги ЗМІ, співчуття населення та інше) (2) демонізації росії (для посилення на неї політичного та санкційного тиску, підсилення “русофобії”, дискредитації “сво” та інше).
Саме ці мотиви були найбільш визначальними довготривало, і надалі часто згадувались без пояснень щодо мети “провокації”.
\n Важливою в обговоренні також була мета відволікання уваги від українських воєнних поразок, “неуспішних постановок типу бучі”.
''')

selected_option5 = st.radio('Оберіть, будь ласка, рівень деталізації:', options_general_levels, key='levels5')
st.write(f'Ви переглядаєте рівень деталізації наратива: {selected_option5}')
section5_mapping={
    'Найголовніші узагальнено': 'data_v2/histo_topN_narratives/level2/plot_HISTO_goal50_level2-2.html',
    'Найголовніші деталізовано': 'data_v2/histo_topN_narratives/level1/plot_HISTO_goal25_level1.html',
    'Всі': 'data_v2/histo_topN_narratives/all/all_goal_distribution_by_date_top_percent.html'}
show_plot(section5_mapping, selected_option5)

st.markdown('### Найважливіші мотиви присутні в обговореннях події')
st.markdown('''
Вартим особливої уваги є те, що використання тропу “Буча” домінувало у фреймингу події. Фрейминг використовує вплив подачі інформації на її сприйняття, тож постійні мотиви, згадувані при обговоренні обстрілу, певною мірою визначають, як читачі його сприйматимуть. 
Постійне порівняння з “Бучею” не тільки закріплює враження про обстріл Краматорського вокзала як про “чергову постановку”, а й сприяє закріпленню ідеї, що постановкою є і сама Буча, тому що ця інформація подається імпліцитно, поза межами критичної дискусії. \n
**“Буча-2”** (https://t.me/mardanaka), **“☝️Последствия «сбития Точки-У» в Краматорске. 👉Скоро 🇺🇦🇺🇸СМИ будут трубить о новой Буче.”** (https://t.me/marochkolive), **“А вот и новая "Буча"** (https://t.me/voenkorkotenok), **“Свинопасы делают вторую Бучу, но хуй у вас теперь что выйдет ублюдки. Люська, все зафиксировано.”** (https://t.me/voenacher) і таке інше, а також згадані вище посилання на Арестовича (якого називають також “Люською”) широко використовувались для опису події.
\n Цей опис подавався як напряму (Буча-2), так і непрямо: **“Der Oberste Fuehrer der Schutzstaffel Зеленский не согласовал методичку с SS Reichsfuehrer Арестовичем и заявил, что «Точка-У» оказывается российская. На Западе Буча оказалась забыта слишком быстро. В итоге новую инфоперемогу нацисты делали на коленке и впопыхах.”** (https://t.me/cyber_frontz).
\n Мотив порівняння до “інших злочинів на Донбасі”, згадуваний одночасно з доказом “Україна активно використовувала Точку У для інших обстрілів”, також є важливим фреймінгом, який ставить обстріл в ряд подій, описуваних як “кровавые преступления украинского режима”, затверджуючи магістральний пропагандистський наратив “8 лет бомбили Донбасс”.
\n Серед інших наративів фреймінгу можна виокремити паралелі до провокацій і приписуваних “Заходу” уособленому США військові злочинів, в тому числі популярних міфів: **“Доказательство вины РФ столь же "весомое", сколь и пробирка покойного Пауэлла перед вторжением в Ирак”** (https://t.me/rlz_the_kraken), також часто наводяться паралелі із Сирією: **"Украина терпит поражение и потому использует тактику сирийских террористов — атакует гражданских и призывает к внешнему вмешательству", — заявил Брайан Берлетик, геополитический аналитик и бывший военнослужащий Корпуса морской пехоты США об инциденте в Краматорске.”** (https://t.me/soldiers_truth).
Для обговорення події (особливо зі згадками Бучі, Маріуполя, Бородянки) активно використовуються термінологія з метафоричного поля шоу, спектаклей, постановки, КВК і клоунади (особливо при згадках президента Зеленського), прислівʼя про обман (“На воре шапка горит”, “Мальчик и волки”).
''')

selected_option6 = st.radio('Оберіть, будь ласка, рівень деталізації:', options_general_levels, key='levels6')
st.write(f'Ви переглядаєте рівень деталізації наратива: {selected_option6}')
section6_mapping={
    'Найголовніші узагальнено': 'data_v2/histo_topN_narratives/level2/plot_HISTO_framing25_level2.html',
    'Найголовніші деталізовано': 'data_v2/histo_topN_narratives/level1/plot_HISTO_framing25_level1.html',
    'Всі': 'data_v2/histo_topN_narratives/all/all_framing_distribution_by_date_top_percent.html'}
show_plot(section6_mapping, selected_option6)


st.markdown('### Хто був першоджерелом повідомлень для кожного типу наративу в межах нашого набору Телеграм каналів?')
st.write('https://t.me/ssigny, https://t.me/breege_time_20zz, https://t.me/medvedevvesti та https://t.me/ags_donbass є каналами, що запускали найбільше тиражованих повідомлень.',
         'В таблицях нижче подано перші повідомлення з кожної відповідної групи з датами та каналами, що їх поширили.',
         'Клікніть на повідомлення для того, щоб прочитати його повністю.')


options_general_narratives_reduced3 = ['Докази', 'Мета', "Фреймінг"]
selected_option3 = st.radio('Оберіть, будь ласка, тип наратива:', options_general_narratives_reduced3, key='unique_narrative_source')
st.write(f'Ви переглядаєте динаміку наратива: {selected_option3}')
section3_mapping={
    'Докази': 'data_v2/first_narrative_tables/unique_evidence_level2 (1).csv',
    # 'Винуватець': None,
    'Мета': 'data_v2/first_narrative_tables/df_unique_goals.csv',
    'Фреймінг': 'data_v2/first_narrative_tables/df_unique_framing.csv'}

st.dataframe(load_data(section3_mapping[selected_option3]), height=400)

st.markdown('### Хто найбільше розповсюджував трафаретні повідомлення')

st.markdown('''
Для розуміння моделі оркестрації поширення повідомлень, ми візуалізували найактивніших перших поширювачів “трафаретних” повідомлень (таких, що повністю, або частково повторюються в різних постах), разом із наративами, які вони найчастіше поширювали. 

Серед наративів доказів популярним серед таких поширювачів є “Точка У только украинское оружие” і “Траектория полета”. 
“Провокация для усиления санкций” є найпопулярнішим твердженням серед наративів мети, поширюваних такими каналами. 
“Постановка как в Буче, Мариуполе” и “Продолжение украинских преступлений на Донбассе” є найпопулярнішими мотивами у фреймінгу таких перших поширювачів.
''')

selected_option7 = st.radio('Оберіть, будь ласка, рівень деталізації:', options_general_narratives_reduced3, key='levels7')
st.write(f'Ви переглядаєте рівень деталізації наратива: {selected_option7}')
section7_mapping={
    'Докази': 'data_v2/author_plots/evidence_author_distibution.html',
    'Мета': 'data_v2/author_plots/goal_author_distibution.html',
    'Фреймінг': 'data_v2/author_plots/framing_author_distibution.html'}
show_plot(section7_mapping, selected_option7)


st.markdown('### Розповсюдження трафаретних повідомлень')

st.markdown('''
Для глибшого аналізу поширення таких трафаретних повідомлень, ми проаналізували всіх поширювачів повідомлень (не тільки перших), і вирахували для них показники впливовості для того, щоб візуалізувати динаміку поширення наративу. 
Чи поширюється повідомлення спочатку впливовими каналами? Чи початок поширення містить багато трафаретних повідомлень, і чи є ці повідомлення або автори особливо впливовими?

Ми визначаємо такі показники впливовості:
\n- Впливовість за BC (betweenness centrality) це міра того, наскільки часто автор повідомлення був "містком" в поширенні повідомлень (історично - не суто щодо події). 
\n- Впливовість за EC (eigenvector centrality) це міра того, наскільки впливовими є автори, з якими цей автор взаємодіяв - також, історично. Щобільше впливовими є такі автори, тим більшою є його впливовість за EC.
\n- Впливовість за переглядами це міра того, наскільки багато людей переглянули цей конкретний пост.

Для того, щоб переглянути цікавий вам наратив, оберіть бажаний рівень деталізації, тип наратива і збільшуйте масштаб за потреби, щоб побачити потрібну гранулярність за часом. 
''')
options_8 = ['Докази', 'Мета']
selected_option8 = st.selectbox('Оберіть, будь ласка, тип наратива:', options_8, key='levels8')
options_8_1 = ['Впливовість за переглядами', 'Впливовість за EC', 'Впливовість за BC']
selected_option8_1 = st.selectbox('Оберіть, будь ласка, визначення впливовості:', options_8_1, key='levels81')
options_8_2 = ['Узагальнено', 'Деталізовано']
selected_option8_2 = st.selectbox('Оберіть, будь ласка, рівень узагальнення:', options_8_2, key='levels82')
st.write(f'Ви переглядаєте наратив: {selected_option8}, {selected_option8_1}, {selected_option8_2}')

combo = f'{selected_option8} + {selected_option8_1} + {selected_option8_2}'

combo_mapping8 = {'Докази + Впливовість за переглядами + Узагальнено': 'data_v2/trafaret/SHevidence_swarmplot_by_timesteps_SHAPES_level2_EC.html',
                  'Докази + Впливовість за EC + Узагальнено': 'data_v2/trafaret/SHevidence_swarmplot_by_timesteps_SHAPES_level2_EC.html',
                  'Докази + Впливовість за BC + Узагальнено': 'data_v2/trafaret/SHevidence_swarmplot_by_timesteps_SHAPES_level2_BC.html',
                  'Мета + Впливовість за переглядами + Узагальнено': 'data_v2/trafaret/SHgoal_swarmplot_by_timesteps_SHAPES_level2_VIEWS.html',
                  'Мета + Впливовість за EC + Узагальнено': 'data_v2/trafaret/SHgoal_swarmplot_by_timesteps_SHAPES_level2_EС.html',
                  'Мета + Впливовість за BC + Узагальнено': 'data_v2/trafaret/SHgoal_swarmplot_by_timesteps_SHAPES_level2_EС.html',
                  'Докази + Впливовість за переглядами + Деталізовано': 'data_v2/trafaret/SHevidence_swarmplot_by_timesteps_SHAPES_level1_VIEWS.html',
                  'Докази + Впливовість за EC + Деталізовано': 'data_v2/trafaret/SHevidence_swarmplot_by_timesteps_SHAPES_level1_EC.html',
                  'Докази + Впливовість за BC + Деталізовано': 'data_v2/trafaret/SHevidence_swarmplot_by_timesteps_SHAPES_level1_BC.html',
                  'Мета + Впливовість за переглядами + Деталізовано': 'data_v2/trafaret/SHgoal_swarmplot_by_timesteps_SHAPES_level1_VIEWS.html',
                  'Мета + Впливовість за EC + Деталізовано': 'data_v2/trafaret/SHgoal_swarmplot_by_timesteps_SHAPES_level1_EС.html',
                  'Мета + Впливовість за BC + Деталізовано': 'data_v2/trafaret/SHgoal_swarmplot_by_timesteps_SHAPES_level1_ВС.html'}

show_plot(combo_mapping8, combo)


st.markdown('### Методологія')

st.markdown('''

Аналізована база містить 503 Телеграм канала, повний список доступний за [посиланнням](https://docs.google.com/spreadsheets/d/1a9SK7_r1byLhiM3brJsKySW-3aLkCLQB1EhimUnemEI/edit#gid=1566363984). Аналізований період може не містити пости від всіх поданих в списку каналів - імен не буде в списку авторів повідомлень, якщо вони не публікували постів у цей період, або були тимчасово недоступними - забаненими, закритими.

ChatGPT від OpenAI (з останньою версією ChatGPT4), є назвою для класу передових мовних моделей, які продемонстрували високу ефективність у широкому спектрі завдань обробки природної мови. Їх здатність розуміти, генерувати та реагувати на текст, схожий на людський, робить їх перспективним інструментом для завдань, як-от семантичний аналіз та пошук інформації. Ми використовували модель gpt-4 через API з chat completion endpoint. Ми зформулювали ключові компоненти для контексту, стратегії розробки підказок та відповідні приклади, які можуть вплинути на продуктивність моделі для завдань екстрактивного та абстрактивного характеру. 
Ми розглядаємо абстрактивне завдання пояснення призначеного наратива як генеративне завдання з відповідним вибором метрик. З завданням віднесення  повідомлення до наперед визначених класів ми працюємо як з багатокласовою класифікацією і покладаємося на F1 - це стосується питань щодо релевантності повідомлення темі обстрілу та навмисності дії. Додатково ми отримуємо екстрактивні відповіді, які модель використала для генерації лейбла наратива чи віднесення повідомлення до певного класа для проведення експертного якісного аналізу роботи моделі та ітеративного покращення.
Ми покладаємося на попередньо визначену схему питань, а не на некерований аналіз оповідей. Ми використовуємо схему для загальної структури оповідей за моделлю наратива Лабова та адаптуємо її до нашого дослідницького контексту.

Список аналізованих каналів значний за кількістю і за загальною потужністю покриття аудиторії, проте не виключний, тож певні наративи можуть існувати поза межами цього дослідження, особливо якщо вони поширювались незначними за розміром каналами.
Видалені повідомлення не є доступними для завантаження, тож всі повідомлення, які були опубліковані (і вплинули на медіа простір) але потім видалені, не потрапили в аналізовану вибірку.
''')



